-- DROP ALL ------------------------------------------------------------------------------------

drop table book;
drop table author;
drop table country;
drop table genre;

-- TABLE CREATIONS -----------------------------------------------------------------------------

create table genre(
                      id serial not null primary key,
                      name varchar not null
);

--

create table country(
                        id serial not null primary key,
                        name varchar not null
);

--

create table author(
                       id serial not null primary key,
                       name varchar not null,
                       author_country_id integer not null references country (id) ON UPDATE NO ACTION ON DELETE CASCADE,
                       birthday_year integer not null
);

--

create table book(
                     id serial not null primary key,
                     name varchar not null,
                     book_author_id integer not null references author (id) ON UPDATE NO ACTION ON DELETE CASCADE,
                     year integer not null,
                     book_genre_id integer not null references genre (id) ON UPDATE NO ACTION ON DELETE CASCADE,
                     page_count integer not null
);

-- DATA INSERTIONS ------------------------------------------------------------------------

insert into genre (name)
values
    ('Фантастика'),
    ('Детектив'),
    ('Роман'),
    ('Ужасы'),
    ('Приключения'),
    ('Научная литература'),
    ('Историческая литература'),
    ('Поэзия'),
    ('Эссе'),
    ('Детская литература')
    returning *;

insert into country (name)
values
    ('Россия'),
    ('США'),
    ('Великобритания'),
    ('Австралия')
    returning *;

-- Вставка авторов
insert into author (name, author_country_id, birthday_year)
values
    ('Стивен Кинг', 2, 1947),
    ('Джоан Роулинг', 3, 1965),
    ('Лев Толстой', 1, 1828),
    ('Агата Кристи', 3, 1890),
    ('Федор Достоевский', 1, 1821),
    ('Марк Твен', 2, 1835),
    ('Джордж Оруэлл', 3, 1903),
    ('Эрнест Хемингуэй', 2, 1899),
    ('Габриэль Гарсиа Маркес', 4, 1927),
    ('Джейн Остин', 3, 1775)
    returning *;

-- Вставка книг
insert into book (name, book_author_id, year, book_genre_id, page_count)
values
    ('Сияние', 1, 1977, 1, 688),
    ('Гарри Поттер и философский камень', 2, 1997, 1, 223),
    ('Война и мир', 3, 1869, 3, 1225),
    ('Убийство в Восточном экспрессе', 4, 1934, 2, 256),
    ('Преступление и наказание', 5, 1866, 3, 430),
    ('Приключения Тома Сойера', 6, 1876, 4, 274),
    ('1984', 7, 1949, 1, 328),
    ('Гордость и предубеждение', 8, 1813, 3, 432),
    ('Сто лет одиночества', 9, 1967, 3, 417),
    ('Скотный двор', 4, 1945, 1, 112),
    ('Маленький принц', 10, 1943, 3, 96),
    ('Десять негритят', 4, 1939, 2, 272),
    ('Анна Каренина', 3, 1877, 3, 864),
    ('Старик и море', 8, 1952, 1, 127),
    ('Братья Карамазовы', 5, 1880, 3, 796),
    ('Моби Дик', 6, 1851, 3, 585),
    ('По ком звонит колокол', 7, 1940, 1, 480),
    ('Смерть на Ниле', 4, 1937, 2, 300),
    ('451 градус по Фаренгейту', 7, 1953, 1, 256),
    ('Талисман', 1, 1984, 1, 400),
    ('Солярис', 8, 1961, 1, 204),
    ('Долгий путь к свободе', 9, 1994, 1, 656),
    ('Три мушкетера', 3, 1844, 4, 700),
    ('Собачье сердце', 5, 1925, 2, 224),
    ('Человек в высоком замке', 7, 1962, 1, 288),
    ('Эмма', 10, 1815, 3, 432),
    ('Золотой компас', 9, 1995, 3, 399),
    ('Фауст', 10, 1808, 1, 250),
    ('Тень ветра', 9, 2001, 3, 576),
    ('Другая жизнь', 10, 2010, 3, 400),
    ('Сказка о рыбаке и рыбке', 3, 1835, 4, 32),
    ('Дон Кихот', 3, 1605, 3, 1024),
    ('Слепой музыкант', 4, 1912, 1, 320),
    ('Великий Гэтсби', 6, 1925, 3, 180),
    ('Над пропастью во ржи', 7, 1951, 1, 277),
    ('Убить пересмешника', 8, 1960, 3, 281),
    ('Бойня номер пять', 9, 1969, 1, 275),
    ('Гарри Поттер и тайная комната', 2, 1998, 1, 251),
    ('Гарри Поттер и узник Азкабана', 2, 1999, 1, 317),
    ('Гарри Поттер и кубок огня', 2, 2000, 1, 636),
    ('Гарри Поттер и орден Феникса', 2, 2003, 1, 766),
    ('Гарри Поттер и принц-полукровка', 2, 2005, 1, 652),
    ('Гарри Поттер и дары смерти', 2, 2007, 1, 607),
    ('Метаморфозы', 1, 1915, 1, 300),
    ('На берегу', 1, 1985, 1, 400),
    ('Кошка, которая гуляла сама по себе', 10, 1902, 4, 96),
    ('Портрет Дориана Грея', 8, 1890, 3, 224),
    ('Сумерки', 2, 2005, 1, 498),
    ('Стража! Стража!', 8, 1989, 1, 400),
    ('Сказки старого Вильнюса', 3, 2000, 1, 150),
    ('Сказки на ночь', 1, 2015, 1, 200),
    ('Сердце тьмы', 6, 1899, 1, 96),
    ('Собака Баскервилей', 4, 1902, 2, 256),
    ('Сила воли', 5, 2010, 1, 320),
    ('Тени на солнце', 9, 2005, 1, 400),
    ('Тринадцатая сказка', 10, 2006, 1, 368),
    ('Убить пересмешника', 8, 1960, 3, 281),
    ('Человек-невидимка', 7, 1897, 1, 250),
    ('Шерлок Холмс', 4, 1887, 1, 320),
    ('Я, робот', 1, 1950, 1, 256),
    ('Бегущий в лабиринте', 2, 2009, 1, 374),
    ('В поисках потерянного времени', 3, 1913, 1, 300),
    ('Граф Монте-Кристо', 5, 1844, 1, 1240),
    ('День триффидов', 6, 1951, 1, 256),
    ('Завтрак у Тиффани', 10, 1958, 1, 160),
    ('Игра престолов', 7, 1996, 1, 694),
    ('Код да Винчи', 9, 2003, 1, 454),
    ('Лолита', 8, 1955, 1, 336),
    ('Маленькие женщины', 3, 1868, 1, 480),
    ('На восток от рая', 5, 1952, 1, 400),
    ('Общество мертвых поэтов', 10, 1989, 1, 288),
    ('Песнь льда и огня', 1, 1996, 1, 800),
    ('Робинзон Крузо', 2, 1719, 1, 320),
    ('Скрижали Судьбы', 4, 2000, 1, 400),
    ('Тайна третьей планеты', 5, 1981, 1, 256),
    ('Убить пересмешника', 8, 1960, 3, 281),
    ('Фаренгейт 451', 7, 1953, 1, 256),
    ('Хоббит, или Туда и обратно', 9, 1937, 1, 310),
    ('Цветы для Элджернона', 2, 1966, 1, 311),
    ('Человек на краю', 10, 2015, 1, 400),
    ('Шум и ярость', 1, 1929, 1, 320),
    ('Ясновидение', 2, 2005, 1, 400)
    returning *;

-- DATA SELECTIONS ------------------------------------------------------------------------

select * from genre;
select * from country;
select * from author;
select * from book;
